БухЭксп/InformationRegisters/CW_ЛицаЗамещающиеИнициаторовСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЛицаЗамещающиеИнициаторовСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИнициаторСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицоЗамещающееИнициатораСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоступноИнициацияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступноИнициацияСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доступно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЛицаЗамещающиеИнициаторовСогласования/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.ИнициаторСогласования = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;   
	
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь);
	
	Если ЭтоПолноправныйПользователь = ЛОЖЬ 
		И Запись.ИнициаторСогласования <> ПараметрыСеанса.ТекущийПользователь Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	Элементы.ИнициаторСогласования.Доступность = ЭтоПолноправныйПользователь;
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Запись.ИнициаторСогласования);
	
	мИдентификаторыОбъектов = РегистрыСведений.CW_ДоступноИнициацияСогласования.ПолучитьДоступныеОбъектыСогласования(ГруппаПользователя);
	Для Каждого ИдентификаторОбъекта из мИдентификаторыОбъектов Цикл
		Элементы.ИдентификаторОбъектаМетаданных.СписокВыбора.Добавить(ИдентификаторОбъекта);
	КонецЦикла;
	
КонецПроцедуры
